In [1]:
import pandas as pd
import numpy as np

emp_df = pd.DataFrame({
    "EmpID": [201,202,203,204,205,206,207,208,209,210],
    "Name": ["Aman","Riya","Kunal","Sneha","Vikram","Pooja","Rahul","Neha","Arjun","Simran"],
    "Department": ["IT","HR","IT","Finance","HR","IT","Finance","HR","IT","Finance"],
    "Age": [22,25,24,28,26,23,30,27,21,29],
    "Salary": [50000,45000,62000,70000,48000,58000,75000,52000,40000,68000],
    "Experience": [1,2,4,6,3,2,7,4,1,5]
})

emp_df

   EmpID    Name Department  Age  Salary  Experience
0    201    Aman         IT   22   50000           1
1    202    Riya         HR   25   45000           2
2    203   Kunal         IT   24   62000           4
3    204   Sneha    Finance   28   70000           6
4    205  Vikram         HR   26   48000           3
5    206   Pooja         IT   23   58000           2
6    207   Rahul    Finance   30   75000           7
7    208    Neha         HR   27   52000           4
8    209   Arjun         IT   21   40000           1
9    210  Simran    Finance   29   68000           5

In [2]:
# Add a new column Bonus with default value 5000
emp_df["bonus"] = 5000

In [3]:
emp_df

   EmpID    Name Department  Age  Salary  Experience  bonus
0    201    Aman         IT   22   50000           1   5000
1    202    Riya         HR   25   45000           2   5000
2    203   Kunal         IT   24   62000           4   5000
3    204   Sneha    Finance   28   70000           6   5000
4    205  Vikram         HR   26   48000           3   5000
5    206   Pooja         IT   23   58000           2   5000
6    207   Rahul    Finance   30   75000           7   5000
7    208    Neha         HR   27   52000           4   5000
8    209   Arjun         IT   21   40000           1   5000
9    210  Simran    Finance   29   68000           5   5000

In [4]:
# Add a column Level

# Salary ≥ 65000 → "Senior"

# Salary 50000–64999 → "Mid"

# Salary < 50000 → "Junior"

emp_df["Level"] = "Junior"
emp_df.loc[emp_df["Salary"]>=65000,"Level"] = "Senior"
emp_df.loc[(emp_df["Salary"]>50000) & (emp_df["Salary"]<64999),"Level"] = "Mid"
emp_df

   EmpID    Name Department  Age  Salary  Experience  bonus   Level
0    201    Aman         IT   22   50000           1   5000  Junior
1    202    Riya         HR   25   45000           2   5000  Junior
2    203   Kunal         IT   24   62000           4   5000     Mid
3    204   Sneha    Finance   28   70000           6   5000  Senior
4    205  Vikram         HR   26   48000           3   5000  Junior
5    206   Pooja         IT   23   58000           2   5000     Mid
6    207   Rahul    Finance   30   75000           7   5000  Senior
7    208    Neha         HR   27   52000           4   5000     Mid
8    209   Arjun         IT   21   40000           1   5000  Junior
9    210  Simran    Finance   29   68000           5   5000  Senior

In [5]:
new_row = pd.DataFrame([{
"EmpID": 211,
"Name": "Rohit",
"Department": "IT",
"Age": 26,
"Salary": 60000,
"Experience": 3,
"bonus": 5000,
"Level": "Mid"
}])

emp_df = pd.concat([emp_df,new_row],ignore_index=True)
emp_df

    EmpID    Name Department  Age  Salary  Experience  bonus   Level
0     201    Aman         IT   22   50000           1   5000  Junior
1     202    Riya         HR   25   45000           2   5000  Junior
2     203   Kunal         IT   24   62000           4   5000     Mid
3     204   Sneha    Finance   28   70000           6   5000  Senior
4     205  Vikram         HR   26   48000           3   5000  Junior
5     206   Pooja         IT   23   58000           2   5000     Mid
6     207   Rahul    Finance   30   75000           7   5000  Senior
7     208    Neha         HR   27   52000           4   5000     Mid
8     209   Arjun         IT   21   40000           1   5000  Junior
9     210  Simran    Finance   29   68000           5   5000  Senior
10    211   Rohit         IT   26   60000           3   5000     Mid

In [6]:
# Increase Salary by 10% for employees from IT department

emp_df.loc[emp_df["Department"]== "IT","Salary"] *= 1.10
emp_df

/var/folders/r7/f95gykkj207bjlzqqdrkl7d40000gn/T/ipykernel_15701/383548670.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '[55000. 68200. 63800. 44000. 66000.]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  emp_df.loc[emp_df["Department"]== "IT","Salary"] *= 1.10

    EmpID    Name Department  Age   Salary  Experience  bonus   Level
0     201    Aman         IT   22  55000.0           1   5000  Junior
1     202    Riya         HR   25  45000.0           2   5000  Junior
2     203   Kunal         IT   24  68200.0           4   5000     Mid
3     204   Sneha    Finance   28  70000.0           6   5000  Senior
4     205  Vikram         HR   26  48000.0           3   5000  Junior
5     206   Pooja         IT   23  63800.0           2   5000     Mid
6     207   Rahul    Finance   30  75000.0           7   5000  Senior
7     208    Neha         HR   27  52000.0           4   5000     Mid
8     209   Arjun         IT   21  44000.0           1   5000  Junior
9     210  Simran    Finance   29  68000.0           5   5000  Senior
10    211   Rohit         IT   26  66000.0           3   5000     Mid

In [7]:
# Increase Bonus to 8000 for employees with Experience ≥ 5
emp_df.loc[emp_df["Experience"]>=5,"bonus"] = 8000
emp_df

    EmpID    Name Department  Age   Salary  Experience  bonus   Level
0     201    Aman         IT   22  55000.0           1   5000  Junior
1     202    Riya         HR   25  45000.0           2   5000  Junior
2     203   Kunal         IT   24  68200.0           4   5000     Mid
3     204   Sneha    Finance   28  70000.0           6   8000  Senior
4     205  Vikram         HR   26  48000.0           3   5000  Junior
5     206   Pooja         IT   23  63800.0           2   5000     Mid
6     207   Rahul    Finance   30  75000.0           7   8000  Senior
7     208    Neha         HR   27  52000.0           4   5000     Mid
8     209   Arjun         IT   21  44000.0           1   5000  Junior
9     210  Simran    Finance   29  68000.0           5   8000  Senior
10    211   Rohit         IT   26  66000.0           3   5000     Mid

In [8]:
# Change Department of EmpID 205 to "Finance"
emp_df.loc[emp_df["EmpID"]==205,"Department"] = "Finance"
emp_df

    EmpID    Name Department  Age   Salary  Experience  bonus   Level
0     201    Aman         IT   22  55000.0           1   5000  Junior
1     202    Riya         HR   25  45000.0           2   5000  Junior
2     203   Kunal         IT   24  68200.0           4   5000     Mid
3     204   Sneha    Finance   28  70000.0           6   8000  Senior
4     205  Vikram    Finance   26  48000.0           3   5000  Junior
5     206   Pooja         IT   23  63800.0           2   5000     Mid
6     207   Rahul    Finance   30  75000.0           7   8000  Senior
7     208    Neha         HR   27  52000.0           4   5000     Mid
8     209   Arjun         IT   21  44000.0           1   5000  Junior
9     210  Simran    Finance   29  68000.0           5   8000  Senior
10    211   Rohit         IT   26  66000.0           3   5000     Mid

In [11]:
# Update Age of the youngest employee to 22
emp_df.loc[emp_df["Age"]== emp_df["Age"].min(),"Age"] = 22
emp_df

    EmpID    Name Department  Age   Salary  Experience  bonus   Level
0     201    Aman         IT   22  55000.0           1   5000  Junior
1     202    Riya         HR   25  45000.0           2   5000  Junior
2     203   Kunal         IT   24  68200.0           4   5000     Mid
3     204   Sneha    Finance   28  70000.0           6   8000  Senior
4     205  Vikram    Finance   26  48000.0           3   5000  Junior
5     206   Pooja         IT   23  63800.0           2   5000     Mid
6     207   Rahul    Finance   30  75000.0           7   8000  Senior
7     208    Neha         HR   27  52000.0           4   5000     Mid
8     209   Arjun         IT   22  44000.0           1   5000  Junior
9     210  Simran    Finance   29  68000.0           5   8000  Senior
10    211   Rohit         IT   26  66000.0           3   5000     Mid

In [13]:
# Delete the column Bonus
emp_df.drop("bonus",axis=1,inplace=True)
emp_df

    EmpID    Name Department  Age   Salary  Experience   Level
0     201    Aman         IT   22  55000.0           1  Junior
1     202    Riya         HR   25  45000.0           2  Junior
2     203   Kunal         IT   24  68200.0           4     Mid
3     204   Sneha    Finance   28  70000.0           6  Senior
4     205  Vikram    Finance   26  48000.0           3  Junior
5     206   Pooja         IT   23  63800.0           2     Mid
6     207   Rahul    Finance   30  75000.0           7  Senior
7     208    Neha         HR   27  52000.0           4     Mid
8     209   Arjun         IT   22  44000.0           1  Junior
9     210  Simran    Finance   29  68000.0           5  Senior
10    211   Rohit         IT   26  66000.0           3     Mid

In [14]:
# Delete employees whose Salary < 45000
emp_df.drop(emp_df[emp_df["Salary"]<45000].index,inplace=True)
emp_df

    EmpID    Name Department  Age   Salary  Experience   Level
0     201    Aman         IT   22  55000.0           1  Junior
1     202    Riya         HR   25  45000.0           2  Junior
2     203   Kunal         IT   24  68200.0           4     Mid
3     204   Sneha    Finance   28  70000.0           6  Senior
4     205  Vikram    Finance   26  48000.0           3  Junior
5     206   Pooja         IT   23  63800.0           2     Mid
6     207   Rahul    Finance   30  75000.0           7  Senior
7     208    Neha         HR   27  52000.0           4     Mid
9     210  Simran    Finance   29  68000.0           5  Senior
10    211   Rohit         IT   26  66000.0           3     Mid

In [15]:
# Delete employees whose Experience < 2
emp_df.drop(emp_df[emp_df["Experience"]<2].index,inplace=True)
emp_df

    EmpID    Name Department  Age   Salary  Experience   Level
1     202    Riya         HR   25  45000.0           2  Junior
2     203   Kunal         IT   24  68200.0           4     Mid
3     204   Sneha    Finance   28  70000.0           6  Senior
4     205  Vikram    Finance   26  48000.0           3  Junior
5     206   Pooja         IT   23  63800.0           2     Mid
6     207   Rahul    Finance   30  75000.0           7  Senior
7     208    Neha         HR   27  52000.0           4     Mid
9     210  Simran    Finance   29  68000.0           5  Senior
10    211   Rohit         IT   26  66000.0           3     Mid

In [18]:
# Keep only employees from IT & Finance departments
emp_df = emp_df[emp_df["Department"].isin(["IT","Finance"])]

In [19]:
emp_df

    EmpID    Name Department  Age   Salary  Experience   Level
2     203   Kunal         IT   24  68200.0           4     Mid
3     204   Sneha    Finance   28  70000.0           6  Senior
4     205  Vikram    Finance   26  48000.0           3  Junior
5     206   Pooja         IT   23  63800.0           2     Mid
6     207   Rahul    Finance   30  75000.0           7  Senior
9     210  Simran    Finance   29  68000.0           5  Senior
10    211   Rohit         IT   26  66000.0           3     Mid

In [20]:
print(emp_df["Department"].unique())

['IT' 'Finance']

In [21]:
# Add a column Status:

# Salary ≥ 60000 → "High Paid"

# Else → "Normal"

emp_df["Status"] = "Normal"
emp_df.loc[emp_df["Salary"]>=60000,"Status"] = "High Paid"
emp_df

/var/folders/r7/f95gykkj207bjlzqqdrkl7d40000gn/T/ipykernel_15701/1621465523.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp_df["Status"] = "Normal"

    EmpID    Name Department  Age   Salary  Experience   Level     Status
2     203   Kunal         IT   24  68200.0           4     Mid  High Paid
3     204   Sneha    Finance   28  70000.0           6  Senior  High Paid
4     205  Vikram    Finance   26  48000.0           3  Junior     Normal
5     206   Pooja         IT   23  63800.0           2     Mid  High Paid
6     207   Rahul    Finance   30  75000.0           7  Senior  High Paid
9     210  Simran    Finance   29  68000.0           5  Senior  High Paid
10    211   Rohit         IT   26  66000.0           3     Mid  High Paid

In [ ]:
# Add column → df["col"] = value

# Conditional update → df.loc[condition, "col"] = value

# Delete rows → df.drop(df[condition].index, inplace=True)

# Delete column → df.drop("col", axis=1, inplace=True)

In [24]:
# Reset index after deletions
emp_df.reset_index(drop=True,inplace=True)
emp_df

   EmpID    Name Department  Age   Salary  Experience   Level     Status
0    203   Kunal         IT   24  68200.0           4     Mid  High Paid
1    204   Sneha    Finance   28  70000.0           6  Senior  High Paid
2    205  Vikram    Finance   26  48000.0           3  Junior     Normal
3    206   Pooja         IT   23  63800.0           2     Mid  High Paid
4    207   Rahul    Finance   30  75000.0           7  Senior  High Paid
5    210  Simran    Finance   29  68000.0           5  Senior  High Paid
6    211   Rohit         IT   26  66000.0           3     Mid  High Paid

In [ ]:
# Sort DataFrame by Salary (descending)
emp_df.sort_values("Salary",ascending=False) # by default order is ascending order , for descending order ascending = false
emp_df

   EmpID    Name Department  Age   Salary  Experience   Level     Status
0    203   Kunal         IT   24  68200.0           4     Mid  High Paid
1    204   Sneha    Finance   28  70000.0           6  Senior  High Paid
2    205  Vikram    Finance   26  48000.0           3  Junior     Normal
3    206   Pooja         IT   23  63800.0           2     Mid  High Paid
4    207   Rahul    Finance   30  75000.0           7  Senior  High Paid
5    210  Simran    Finance   29  68000.0           5  Senior  High Paid
6    211   Rohit         IT   26  66000.0           3     Mid  High Paid

In [ ]:
# emp_df.rename(columns={"Salary":"Monthly_Salary"},inplace=True)